InformationRegisters/бит_ПолучателиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПолучателиДенежныхСредств</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолучательДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_УслугиЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_УслугиЖКХ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыНачислений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыНачисленийПоЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафаОтчетаГЦЖС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ГрафыОтчетаПоГЦЖС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевыеСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначениеЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвижениеЦС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДвиженияЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖСОбщеДом</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС_КПУ</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС_ДПУ</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовыеНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>нвл_ИспользоватьТариф</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>лб_ГруппаУслугДляПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ГруппыУслугДляПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпособыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РежимыПотребленияУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РежимПотребленияУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_ПолучателиДенежныхСредств/Forms/ФормаСпискаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// БИТ_ЖКХ 25.03.2014 
// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения  = Новый Структура; 
	
	КэшированныеЗначения.Вставить("Ошибка", Ложь);
	
	Попытка
		
		КэшированныеЗначения.Вставить("мУслугаОтбор", Параметры.Отбор.Услуга);
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// БИТ_ЖКХ 25.03.2014
	ОтборПоУслуге = Истина;
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	ЗаполнитьТаблицуСписок();
	// БИТ_ЖКХ 25.03.2014	
КонецПроцедуры

// БИТ_ЖКХ 25.03.2014
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если мКэшЗначений.Ошибка = Истина Тогда
		
		Элементы.ОтборПоУслуге.Видимость = Ложь;	
		
	КонецЕсли;	
	
	ВыполняетсяУдаление = Ложь;
	
КонецПроцедуры
// БИТ_ЖКХ 25.03.2014

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	// Изменение модального вызова.
	Отказ = Истина;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СписокПередУдалениемЗавершение",ЭтотОбъект),
	"Удалить запись?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// БИТ_ЖКХ 19.11.2014{{
&НаКлиенте
Процедура СписокПередУдалениемЗавершение(РезультатВопроса,ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда	
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		УдалитьЗаписьНаСервере(ТекущиеДанные.Период, ТекущиеДанные.Услуга, ТекущиеДанные.Поставщик);
		
		ЗаполнитьТаблицуСписок();
		
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 19.11.2014}}

&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Или Копирование Тогда
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		Если Не ТекущиеДанные = Неопределено Тогда
			
			ТекущиеДанные.Период        = НачалоМесяца(ТекущаяДата());
			ТекущиеДанные.НомерКартинки = 0;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		
		Если ТекущиеДанные.Период = Дата(1, 1, 1) Или
			ТекущиеДанные.Услуга = ПредопределенноеЗначение("Справочник.бит_УслугиЖКХ.ПустаяСсылка") Или
			ТекущиеДанные.Поставщик = ПредопределенноеЗначение("Справочник.бит_ПоставщикиУслуг.ПустаяСсылка") Тогда
			
			// БИТ_ЖКХ_31012014_начало_изменений
			Если Не ОтменаРедактирования Тогда
				// БИТ_ЖКХ_31012014_окончание_изменений
				
				
				Отказ = Истина;
				
				Если ТекущиеДанные.Период = Дата(1, 1, 1) Тогда

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед записью заполните измерение ""Период"" ");
					
				КонецЕсли;	
				
				Если ТекущиеДанные.Услуга = ПредопределенноеЗначение("Справочник.бит_УслугиЖКХ.ПустаяСсылка") Тогда

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед записью заполните измерение ""Услуга"" ");
					
				КонецЕсли;
				
				Если ТекущиеДанные.Поставщик = ПредопределенноеЗначение("Справочник.бит_ПоставщикиУслуг.ПустаяСсылка") Тогда

					бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Перед записью заполните измерение ""Поставщик"" ");
					
				КонецЕсли;
				
				// БИТ_ЖКХ_31012014_начало_изменений	
			КонецЕсли; 
			// БИТ_ЖКХ_31012014_окончание_изменений
			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		ДобавитьЗаписьНаСервере(ТекущиеДанные.Период, ТекущиеДанные.Услуга, ТекущиеДанные.Поставщик, ТекущиеДанные.ПолучательДенежныхСредств, ТекущиеДанные.ДоговорКонтрагента);
		
		ЗаполнитьТаблицуСписок();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	ЗаполнитьТаблицуСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательДенежныхСредствОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	// БИТ_ЖКХ 12.02.2014	
	Если НЕ ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда
		// БИТ_ЖКХ 12.02.2014		
		
		Если ТипЗнч(ТекущиеДанные.ПолучательДенежныхСредств) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			Если НЕ ВыбранноеЗначение = Неопределено И ПолучитьЭтоГруппаПолучателяДенежныхСредств(ВыбранноеЗначение) Тогда
				
				СтандартнаяОбработка = Ложь;

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нельзя указывать группу контрагентов как получателя денежных средств.");
				
			КонецЕсли;
			
		КонецЕсли; 
		
		// БИТ_ЖКХ 12.02.2014
	КонецЕсли; 
	// БИТ_ЖКХ 12.02.2014	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СтандартнаяОбработка = Ложь;
	
	СписокПоставщики = ПолучитьСписокПоставщикиНаСервере(ТекущаяСтрока.Услуга);
	
	ОтборВФорме = Новый Структура("Ссылка", СписокПоставщики);
	
	ОткрытьФорму("Справочник.бит_ПоставщикиУслуг.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", ОтборВФорме), Элемент);
	
КонецПроцедуры

// БИТ_ЖКХ 25.03.2014
&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)
	
	ЗаполнитьТаблицуСписок();	
	
КонецПроцедуры
// БИТ_ЖКХ 25.03.2014

// БИТ_ЖКХ 27.05.2014
&НаКлиенте
Процедура ПолучательДенежныхСредствНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные.ПолучательДенежныхСредств <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		
		Если ТипЗнч(ТекущиеДанные.ПолучательДенежныхСредств) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			ПараметрыФормы.Вставить("Ссылка",ТекущиеДанные.ПолучательДенежныхСредств);
			
			ФормаВыбора = ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора",ПараметрыФормы,Элемент);	
			
		Иначе
			
			ОткрытьФорму("Справочник.Организации.Форма.ФормаВыбора",,Элемент);	
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
// БИТ_ЖКХ 27.05.2014

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьТаблицуСписок();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
// БИТ_ЖКХ 12.02.2014
// Функция ПолучитьЭтоГруппаПолучателяДенежныхСредств(Знач ПолучательДенежныхСредств).
Функция ПолучитьЭтоГруппаПолучателяДенежныхСредств(ПолучательДенежныхСредств)
	
	Возврат ПолучательДенежныхСредств.ЭтоГруппа;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокПоставщикиНаСервере(Услуга)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", Услуга);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_УслугиЖКХПоставщики.Поставщик
	|ИЗ
	|	Справочник.бит_УслугиЖКХ.Поставщики КАК бит_УслугиЖКХПоставщики
	|ГДЕ
	|	бит_УслугиЖКХПоставщики.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокПоставщики = Новый СписокЗначений;
	
	СписокПоставщики.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Поставщик"));
	
	Возврат СписокПоставщики;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуСписок()
	// БИТ_ЖКХ 25.03.2014
	Попытка 	
		
		Если ОтборПоУслуге Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	бит_ПолучателиДенежныхСредств.Период,
			|	бит_ПолучателиДенежныхСредств.Услуга,
			|	бит_ПолучателиДенежныхСредств.Поставщик,
			|	бит_ПолучателиДенежныхСредств.ПолучательДенежныхСредств,
			|	бит_ПолучателиДенежныхСредств.ДоговорКонтрагента,
			|	0 КАК НомерКартинки
			|ИЗ
			|	РегистрСведений.бит_ПолучателиДенежныхСредств КАК бит_ПолучателиДенежныхСредств
			|ГДЕ
			|	бит_ПолучателиДенежныхСредств.Услуга = &Услуга");
			
			
			Запрос.УстановитьПараметр("Услуга",мКэшЗначений.мУслугаОтбор);
			
		Иначе
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	бит_ПолучателиДенежныхСредств.Период,
			|	бит_ПолучателиДенежныхСредств.Услуга,
			|	бит_ПолучателиДенежныхСредств.Поставщик,
			|	бит_ПолучателиДенежныхСредств.ПолучательДенежныхСредств,
			|	бит_ПолучателиДенежныхСредств.ДоговорКонтрагента,
			|	0 КАК НомерКартинки
			|ИЗ
			|	РегистрСведений.бит_ПолучателиДенежныхСредств КАК бит_ПолучателиДенежныхСредств");
			
		КонецЕсли;
		
	Исключение
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	бит_ПолучателиДенежныхСредств.Период,
		|	бит_ПолучателиДенежныхСредств.Услуга,
		|	бит_ПолучателиДенежныхСредств.Поставщик,
		|	бит_ПолучателиДенежныхСредств.ПолучательДенежныхСредств,
		|	бит_ПолучателиДенежныхСредств.ДоговорКонтрагента,
		|	0 КАК НомерКартинки
		|ИЗ
		|	РегистрСведений.бит_ПолучателиДенежныхСредств КАК бит_ПолучателиДенежныхСредств");
		
		мКэшЗначений.Ошибка = Истина;
		
		
	КонецПопытки;
	
	
	Список.Загрузить(Запрос.Выполнить().Выгрузить());
	// БИТ_ЖКХ 25.03.2014
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьНаСервере(Знач Период, Знач Услуга, Знач Поставщик, Знач ПолучательДенежныхСредств, Знач ДоговорКонтрагента)
	
	МенеджерЗаписи = РегистрыСведений.бит_ПолучателиДенежныхСредств.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период                    = Период;
	МенеджерЗаписи.Услуга                    = Услуга;
	МенеджерЗаписи.Поставщик                 = Поставщик;
	МенеджерЗаписи.ПолучательДенежныхСредств = ПолучательДенежныхСредств;
	МенеджерЗаписи.ДоговорКонтрагента        = ДоговорКонтрагента;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьНаСервере(Знач Период, Знач Услуга, Знач Поставщик)
	
	НаборЗаписей = РегистрыСведений.бит_ПолучателиДенежныхСредств.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Услуга.Установить(Услуга);
	НаборЗаписей.Отбор.Поставщик.Установить(Поставщик);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
